Revit 2017 API
StructuralSectionRoundBar Class
 Defines parameters for Round Bar structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionRoundBar : StructuralSectionRound
Visual Basic
Public Class StructuralSectionRoundBar _
	Inherits StructuralSectionRound
Visual C++
public ref class StructuralSectionRoundBar : public StructuralSectionRound
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
See Also
StructuralSectionRoundBar Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace